============================================
Strange indentifiers and strange values
============================================
#this is a comment, but the following line does not contain a comment:
0valid~_key;name!: #bullet in the head
"!#$%&'()*+,-./0123456789;<=>?@": ??????????????????? |
_^`\[]{}|~: very valid indeed
escape_line?: .
no_space!:nospace!!

---

(source
    (comment)
    (paragraph
        (statement
          (field_name)
          (field_value
            (simple_value)))
        (statement
          (field_name)
          (field_value
            (simple_value)))
        (statement
          (field_name)
          (field_value
            (simple_value)))
        (statement
          (field_name)
          (field_value
            (simple_value)))
        (statement
          (field_name)
          (field_value
            (simple_value)))))


============================================
Interleaved comments
============================================
#normal comment
Key: Line 1
#interleaved comment (logical line 1)
 Line 2
 Line 3
#interleaved comment (logical line 3)
 .
#interleaved comment (logical line 4)
 Line 5

---
(source
    (comment)
    (paragraph
        (statement
          (field_name)
          (field_value
            (simple_value)
          (comment)
          (folded_line)
          (folded_line)
          (comment)
          (escape_line)
          (comment)
          (folded_line)))))

============================================
Empty values
============================================
Key:
Key2: 
Key3:

---
(source
  (paragraph
    (statement
      (field_name)
      (field_value
        (simple_value)))
    (statement
      (field_name)
      (field_value
        (simple_value)))
    (statement
      (field_name)
      (field_value
        (simple_value)))))


============================================
Unicode
============================================
#Unicode æ³¨é‡Š
# Note that key field can't contain Unicode characters.
key: ä¸­æ–‡å€¼
key2: Unicode 13 (emoji):ðŸ§‹

---

(source
    (comment)
    (comment)
    (paragraph
        (statement
          (field_name)
          (field_value
            (simple_value)))
        (statement
          (field_name)
          (field_value
            (simple_value)))))
